package project.club.backend;

import project.club.backend.repository.*;

import project.club.backend.entity.*


import org.springframework.boot.CommandLineRunner;
import org.springframework.stereotype.Component;

import java.time.Instant;
import java.util.Collections;
import java.util.stream.Stream;

@Component
class Initializer implements CommandLineRunner {

    private GroupRepository repository;
    private EventRepository eventRepository;

    private MemberRepository memberRepository;
    private MajorRepository majorRepository;
    private BranchRepository branchRepository;
    private ChangwatRepository changwatRepository;
    private AumphoeRepository aumphoeRepository;

    private RegisterClubRepository registerClubRepository;

    public Initializer(MemberRepository memberRepository, MajorRepository majorRepository,
            BranchRepository branchRepository, ChangwatRepository changwatRepository,
            AumphoeRepository aumphoeRepository, RegisterClubRepository registerClubRepository,
            GroupRepository repository, EventRepository eventRepository) {
        this.memberRepository = memberRepository;
        this.majorRepository = majorRepository;
        this.branchRepository = branchRepository;
        this.changwatRepository = changwatRepository;
        this.aumphoeRepository = aumphoeRepository;
        this.registerClubRepository = registerClubRepository;

        this.repository = repository;
        this.eventRepository = eventRepository;

    }

    @Override
    public void run(String... strings) {

        /*
         * Stream.of("Denver JUG", "Utah JUG", "Seattle JUG",
         * "Richmond JUG").forEach(name -> { Group g = new Group();
         * 
         * g.setName(name); repository.save(g);
         * 
         * }
         * 
         * );
         * 
         * Group djug = repository.findByName("Denver JUG"); Event e = new Event();
         * e.setTitle("Full Stack Reactive");
         * e.setDescription("Reactive with Spring Boot + React");
         * e.setDate(Instant.parse("2018-12-12T18:00:00.000Z"));
         * eventRepository.save(e);
         * 
         * djug.setEvents(Collections.singleton(e)); repository.save(djug);
         * 
         * repository.findAll().forEach(System.out::println);
         */

        changwat();

    }

    public void changwat(String... strings) {
        Stream.of("กรุงเทพมหานคร", "สมุทรปราการ", "นนทบุรี", "ปทุมธานี", "พระนครศรีอยุธยา", "อ่างทอง", "ลพบุรี",
                "สิงห์บุรี", "ชัยนาท", "สระบุรี", "ชลบุรี", "ระยอง", "จันทบุรี", "ตราด", "ฉะเชิงเทรา", "ปราจีนบุรี",
                "นครนายก", "สระแก้ว", "นครราชสีมา", "บุรีรัมย์", "สุรินทร์", "ศรีสะเกษ", "อุบลราชธานี", "ยโสธร",
                "ชัยภูมิ", "อำนาจเจริญ", "บึงกาฬ", "หนองบัวลำภู", "ขอนแก่น", "อุดรธานี", "เลย", "หนองคาย", "มหาสารคาม",
                "ร้อยเอ็ด", "กาฬสินธุ์", "สกลนคร", "นครพนม", "มุกดาหาร", "เชียงใหม่", "ลำพูน", "ลำปาง", "อุตรดิตถ์",
                "แพร่", "น่าน", "พะเยา", "เชียงราย", "แม่ฮ่องสอน", "นครสวรรค์", "อุทัยธานี", "กำแพงเพชร", "ตาก",

                "สุโขทัย", "พิษณุโลก", "พิจิตร", "เพชรบูรณ์", "ราชบุรี", "กาญจนบุรี", "สุพรรณบุรี", "นครปฐม",

                "สมุทรสาคร", "สมุทรสงคราม", "เพชรบุรี", "ประจวบคีรีขันธ์", "นครศรีธรรมราช", "กระบี่", "พังงา", "ภูเก็ต",

                "สุราษฎร์ธานี", "ระนอง", "ชุมพร", "สงขลา", "สตูล", "ตรัง", "พัทลุง", "ปัตตานี", "ยะลา", "นราธิวาส")
                .forEach(name -> {

                    Changwat ch = new Changwat();

                    ch.setChangwat(name);
                    changwatRepository.save(ch);

                    switch (name) {
                    /* 1 */case "กรุงเทพมหานคร":
                        Stream.of("เขตพระนคร", "เขตดุสิต", "เขตหนองจอก", "เขตบางรัก", "เขตบางเขน", "เขตบางกะปิ",
                                "เขตปทุมวัน", "เขตป้อมปราบศัตรูพ่าย", "เขตพระโขนง", "เขตมีนบุรี", "เขตลาดกระบัง",
                                "เขตยานนาวา", "เขตสัมพันธวงศ์", "เขตพญาไท", "เขตธนบุรี", "เขตบางกอกใหญ่", "เขตห้วยขวาง",
                                "เขตคลองสาน", "เขตตลิ่งชัน", "เขตบางกอกน้อย", "เขตบางขุนเทียน", "เขตภาษีเจริญ",
                                "เขตหนองแขม", "เขตราษฎร์บูรณะ", "เขตบางพลัด", "เขตดินแดง", "เขตบึงกุ่ม", "เขตสาทร",
                                "เขตบางซื่อ", "เขตจตุจักร", "เขตบางคอแหลม", "เขตประเวศ", "เขตคลองเตย", "เขตสวนหลวง",
                                "เขตจอมทอง", "เขตดอนเมือง", "เขตราชเทวี", "เขตลาดพร้าว", "เขตวัฒนา", "เขตบางแค",
                                "เขตหลักสี่", "เขตสายไหม", "เขตคันนายาว", "เขตสะพานสูง", "เขตวังทองหลาง",
                                "เขตคลองสามวา", "เขตบางนา", "เขตทวีวัฒนา", "เขตทุ่งครุ", "เขตบางบอน")
                                .forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 2 */case "สมุทรปราการ":
                        Stream.of("อำเภอเมืองสมุทรปราการ", "อำเภอบางบ่อ", "อำเภอบางพลี", "อำเภอพระประแดง",
                                "อำเภอพระสมุทรเจดีย์", "อำเภอบางเสาธง").forEach(aumphoe -> {

                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 3 */case "นนทบุรี":
                        Stream.of("อำเภอเมืองนนทบุรี", "อำเภอบางกรวย", "อำเภอบางใหญ่", "อำเภอบางบัวทอง", "อำเภอไทรน้อย",
                                "อำเภอปากเกร็ด").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;

                    /* 4 */case "ปทุมธานี":
                        Stream.of("อำเภอเมืองปทุมธานี", "อำเภอคลองหลวง", "อำเภอธัญบุรี", "อำเภอหนองเสือ",
                                "อำเภอลาดหลุมแก้ว", "อำเภอลำลูกกา", "อำเภอสามโคก").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 5 */case "พระนครศรีอยุธยา":
                        Stream.of("อำเภอพระนครศรีอยุธยา", "อำเภอท่าเรือ", "อำเภอนครหลวง", "อำเภอบางไทร", "อำเภอบางบาล",
                                "อำเภอบางปะอิน", "อำเภอบางปะหัน", "อำเภอผักไห่", "อำเภอภาชี", "อำเภอลาดบัวหลวง",
                                "อำเภอวังน้อย", "อำเภอเสนา", "อำเภอบางซ้าย", "อำเภออุทัย", "อำเภอมหาราช",
                                "อำเภอบ้านแพรก").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 6 */case "อ่างทอง":
                        Stream.of("อำเภอเมืองอ่างทอง", "อำเภอไชโย", "อำเภอป่าโมก", "อำเภอโพธิ์ทอง", "อำเภอแสวงหา",
                                "อำเภอวิเศษชัยชาญ", "อำเภอสามโก้").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 7 */case "ลพบุรี":
                        Stream.of("อำเภอเมืองลพบุรี", "อำเภอพัฒนานิคม", "อำเภอโคกสำโรง", "อำเภอชัยบาดาล",
                                "อำเภอท่าวุ้ง", "อำเภอบ้านหมี่", "อำเภอท่าหลวง", "อำเภอสระโบสถ์", "อำเภอโคกเจริญ",
                                "อำเภอลำสนธิ", "อำเภอหนองม่วง").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 8 */case "สิงห์บุรี":
                        Stream.of("อำเภอเมืองสิงห์บุรี", "อำเภอบางระจัน", "อำเภอค่ายบางระจัน", "อำเภอพรหมบุรี",
                                "อำเภอท่าช้าง", "อำเภออินทร์บุรี").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 9 */case "ชัยนาท":
                        Stream.of("อำเภอเมืองชัยนาท", "อำเภอมโนรมย์", "อำเภอวัดสิงห์", "อำเภอสรรพยา", "อำเภอสรรคบุรี",
                                "อำเภอหันคา", "อำเภอหนองมะโมง", "อำเภอเนินขาม").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 10 */case "สระบุรี":
                        Stream.of("อำเภอเมืองสระบุรี", "อำเภอแก่งคอย", "อำเภอหนองแค", "อำเภอวิหารแดง", "อำเภอหนองแซง",
                                "อำเภอบ้านหมอ", "อำเภอดอนพุด", "อำเภอหนองโดน", "อำเภอพระพุทธบาท", "อำเภอเสาไห้",
                                "อำเภอมวกเหล็ก", "อำเภอวังม่วง", "อำเภอเฉลิมพระเกียรติ").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 11 */case "ชลบุรี":
                        Stream.of("อำเภอเมืองชลบุรี", "อำเภอบ้านบึง", "อำเภอหนองใหญ่", "อำเภอบางละมุง", "อำเภอพานทอง",
                                "อำเภอพนัสนิคม", "อำเภอศรีราชา", "อำเภอเกาะสีชัง", "อำเภอสัตหีบ", "อำเภอบ่อทอง",
                                "อำเภอเกาะจันทร์").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 12 */case "ระยอง":
                        Stream.of("อำเภอเมืองระยอง", "อำเภอบ้านฉาง", "อำเภอแกลง", "อำเภอวังจันทร์", "อำเภอบ้านค่าย",
                                "อำเภอปลวกแดง", "อำเภอเขาชะเมา", "อำเภอนิคมพัฒนา").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 13 */case "จันทบุรี":
                        Stream.of("อำเภอเมืองจันทบุรี", "อำเภอขลุง", "อำเภอท่าใหม่", "อำเภอโป่งน้ำร้อน", "อำเภอมะขาม",
                                "อำเภอแหลมสิงห์", "อำเภอสอยดาว", "อำเภอแก่งหางแมว", "อำเภอนายายอาม", "อำเภอเขาคิชฌกูฏ")
                                .forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;

                    /* 14 */case "ตราด":
                        Stream.of("อำเภอเมืองตราด", "อำเภอคลองใหญ่", "อำเภอเขาสมิง", "อำเภอบ่อไร่", "อำเภอแหลมงอบ",
                                "อำเภอเกาะกูด", "อำเภอเกาะช้าง").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 15 */case "ฉะเชิงเทรา":
                        Stream.of("อำเภอเมืองฉะเชิงเทรา", "อำเภอบางคล้า", "อำเภอบางน้ำเปรี้ยว", "อำเภอบางปะกง",
                                "อำเภอบ้านโพธิ์", "อำเภอพนมสารคาม", "อำเภอราชสาส์น", "อำเภอสนามชัยเขต", "อำเภอแปลงยาว",
                                "อำเภอท่าตะเกียบ", "อำเภอคลองเขื่อน").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 16 */case "ปราจีนบุรี":
                        Stream.of("อำเภอเมืองปราจีนบุรี", "อำเภอกบินทร์บุรี", "อำเภอนาดี", "อำเภอบ้านสร้าง",
                                "อำเภอประจันตคาม", "อำเภอศรีมหาโพธิ", "อำเภอศรีมโหสถ").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 17 */ case "นครนายก":
                        Stream.of("อำเภอเมืองนครนายก", "อำเภอปากพลี", "อำเภอบ้านนา", "อำเภอองครักษ์")
                                .forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 18 */case "สระแก้ว":
                        Stream.of("อำเภอเมืองสระแก้ว", "อำเภอคลองหาด", "อำเภอตาพระยา", "อำเภอวังน้ำเย็น",
                                "อำเภอวัฒนานคร", "อำเภออรัญประเทศ", "อำเภอเขาฉกรรจ์", "อำเภอโคกสูง", "อำเภอวังสมบูรณ์")
                                .forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 19 */case "นครราชสีมา":
                        Stream.of("อำเภอเมืองนครราชสีมา", "อำเภอครบุรี", "อำเภอเสิงสาง", "อำเภอคง", "อำเภอบ้านเหลื่อม",
                                "อำเภอจักราช", "อำเภอโชคชัย", "อำเภอด่านขุนทด", "อำเภอโนนไทย", "อำเภอโนนสูง",
                                "อำเภอขามสะแกแสง", "อำเภอบัวใหญ่", "อำเภอประทาย", "อำเภอปักธงชัย", "อำเภอพิมาย",
                                "อำเภอห้วยแถลง", "อำเภอชุมพวง", "อำเภอสูงเนิน", "อำเภอขามทะเลสอ", "อำเภอสีคิ้ว",
                                "อำเภอปากช่อง", "อำเภอหนองบุญมาก", "อำเภอแก้งสนามนาง", "อำเภอโนนแดง",
                                "อำเภอวังน้ำเขียว", "อำเภอเทพารักษ์", "อำเภอเมืองยาง", "อำเภอพระทองคำ",
                                "อำเภอลำทะเมนชัย", "อำเภอบัวลาย", "อำเภอสีดา", "อำเภอเฉลิมพระเกียรติ")
                                .forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 20 */ case "บุรีรัมย์":
                        Stream.of("อำเภอเมืองบุรีรัมย์", "อำเภอคูเมือง", "อำเภอกระสัง", "อำเภอนางรอง", "อำเภอหนองกี่",
                                "อำเภอละหานทราย", "อำเภอประโคนชัย", "อำเภอบ้านกรวด", "อำเภอพุทไธสง", "อำเภอลำปลายมาศ",
                                "อำเภอสตึก", "อำเภอปะคำ", "อำเภอนาโพธิ์", "อำเภอหนองหงส์", "อำเภอพลับพลาชัย",
                                "อำเภอห้วยราช", "อำเภอโนนสุวรรณ", "อำเภอชำนิ", "อำเภอบ้านใหม่ไชยพจน์", "อำเภอโนนดินแดง",
                                "อำเภอบ้านด่าน", "อำเภอแคนดง", "อำเภอเฉลิมพระเกียรติ").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 21 */case "สุรินทร์":
                        Stream.of("อำเภอเมืองสุรินทร์", "อำเภอชุมพลบุรี", "อำเภอท่าตูม", "อำเภอจอมพระ", "อำเภอปราสาท",
                                "อำเภอกาบเชิง", "อำเภอรัตนบุรี", "อำเภอสนม", "อำเภอศีขรภูมิ", "อำเภอสังขะ",
                                "อำเภอลำดวน", "อำเภอสำโรงทาบ", "อำเภอบัวเชด", "อำเภอพนมดงรัก", "อำเภอศรีณรงค์",
                                "อำเภอเขวาสินรินทร์", "อำเภอโนนนารายณ์").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 22 */ case "ศรีสะเกษ":
                        Stream.of("อำเภอเมืองศรีสะเกษ", "อำเภอยางชุมน้อย", "อำเภอกันทรารมย์", "อำเภอกันทรลักษ์",
                                "อำเภอขุขันธ์", "อำเภอไพรบึง", "อำเภอปรางค์กู่", "อำเภอขุนหาญ", "อำเภอราษีไศล",
                                "อำเภออุทุมพรพิสัย", "อำเภอบึงบูรพ์", "อำเภอห้วยทับทัน", "อำเภอโนนคูณ", "อำเภอศรีรัตนะ",
                                "อำเภอน้ำเกลี้ยง", "อำเภอวังหิน", "อำเภอภูสิงห์", "อำเภอเมืองจันทร์", "อำเภอเบญจลักษ์",
                                "อำเภอพยุห์", "อำเภอโพธิ์ศรีสุวรรณ", "อำเภอศิลาลาด").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 23 */case "อุบลราชธานี":
                        Stream.of("อำเภอเมืองอุบลราชธานี", "อำเภอศรีเมืองใหม่", "อำเภอโขงเจียม", "อำเภอเขื่องใน",
                                "อำเภอเขมราฐ", "อำเภอเดชอุดม", "อำเภอนาจะหลวย", "อำเภอน้ำยืน", "อำเภอบุณฑริก",
                                "อำเภอตระการพืชผล", "อำเภอกุดข้าวปุ้น", "อำเภอม่วงสามสิบ", "อำเภอวารินชำราบ",
                                "อำเภอพิบูลมังสาหาร", "อำเภอตาลสุม", "อำเภอโพธิ์ไทร", "อำเภอสำโรง", "อำเภอดอนมดแดง",
                                "อำเภอสิรินธร", "อำเภอทุ่งศรีอุดม", "อำเภอนาเยีย", "อำเภอนาตาล", "อำเภอเหล่าเสือโก้ก",
                                "อำเภอสว่างวีระวงศ์", "อำเภอน้ำขุ่น").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 24 */case "ยโสธร":
                        Stream.of("อำเภอเมืองยโสธร", "อำเภอทรายมูล", "อำเภอกุดชุม", "อำเภอคำเขื่อนแก้ว", "อำเภอป่าติ้ว",
                                "อำเภอมหาชนะชัย", "อำเภอค้อวัง", "อำเภอเลิงนกทา", "อำเภอไทยเจริญ").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 25 */case "ชัยภูมิ":
                        Stream.of("อำเภอเมืองชัยภูมิ", "อำเภอบ้านเขว้า", "อำเภอคอนสวรรค์", "อำเภอเกษตรสมบูรณ์",
                                "อำเภอหนองบัวแดง", "อำเภอจัตุรัส", "อำเภอบำเหน็จณรงค์", "อำเภอหนองบัวระเหว",
                                "อำเภอเทพสถิต", "อำเภอภูเขียว", "อำเภอบ้านแท่น", "อำเภอแก้งคร้อ", "อำเภอคอนสาร",
                                "อำเภอภักดีชุมพล", "อำเภอเนินสง่า", "อำเภอซับใหญ่").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 26 */case "อำนาจเจริญ":
                        Stream.of("อำเภอเมืองอำนาจเจริญ", "อำเภอชานุมาน", "อำเภอปทุมราชวงศา", "อำเภอพนา",
                                "อำเภอเสนางคนิคม", "อำเภอหัวตะพาน", "อำเภอลืออำนาจ").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 27 */case "บึงกาฬ":
                        Stream.of("อำเภอเมืองบึงกาฬ", "อำเภอพรเจริญ", "อำเภอโซ่พิสัย", "อำเภอเซกา", "อำเภอปากคาด",
                                "อำเภอบึงโขงหลง", "อำเภอศรีวิไล", "อำเภอบุ่งคล้า").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 28 */case "หนองบัวลำภู":
                        Stream.of("อำเภอเมืองหนองบัวลำภู", "อำเภอนากลาง", "อำเภอโนนสัง", "อำเภอศรีบุญเรือง",
                                "อำเภอสุวรรณคูหา", "อำเภอนาวัง").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 29 */case "ขอนแก่น":
                        Stream.of("อำเภอเมืองขอนแก่น", "อำเภอบ้านฝาง", "อำเภอพระยืน", "อำเภอหนองเรือ", "อำเภอชุมแพ",
                                "อำเภอสีชมพู", "อำเภอน้ำพอง", "อำเภออุบลรัตน์", "อำเภอกระนวน", "อำเภอบ้านไผ่",
                                "อำเภอเปือยน้อย", "อำเภอพล", "อำเภอแวงใหญ่", "อำเภอแวงน้อย", "อำเภอหนองสองห้อง",
                                "อำเภอภูเวียง", "อำเภอมัญจาคีรี", "อำเภอชนบท", "อำเภอเขาสวนกวาง", "อำเภอภูผาม่าน",
                                "อำเภอซำสูง", "อำเภอโคกโพธิ์ไชย", "อำเภอหนองนาคำ", "อำเภอบ้านแฮด", "อำเภอโนนศิลา",
                                "อำเภอเวียงเก่า").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 30 */case "อุดรธานี":
                        Stream.of("อำเภอเมืองอุดรธานี", "อำเภอกุดจับ", "อำเภอหนองวัวซอ", "อำเภอกุมภวาปี",
                                "อำเภอโนนสะอาด", "อำเภอหนองหาน", "อำเภอทุ่งฝน", "อำเภอไชยวาน", "อำเภอศรีธาตุ",
                                "อำเภอวังสามหมอ", "อำเภอบ้านดุง", "อำเภอบ้านผือ", "อำเภอน้ำโสม", "อำเภอเพ็ญ",
                                "อำเภอสร้างคอม", "อำเภอหนองแสง", "อำเภอนายูง", "อำเภอพิบูลย์รักษ์", "อำเภอกู่แก้ว",
                                "อำเภอประจักษ์ศิลปาคม").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 31 */ case "เลย":
                        Stream.of("อำเภอเมืองเลย", "อำเภอนาด้วง", "อำเภอเชียงคาน", "อำเภอปากชม", "อำเภอด่านซ้าย",
                                "อำเภอนาแห้ว", "อำเภอภูเรือ", "อำเภอท่าลี่", "อำเภอวังสะพุง", "อำเภอภูกระดึง",
                                "อำเภอภูหลวง", "อำเภอผาขาว", "อำเภอเอราวัณ", "อำเภอหนองหิน").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 32 */case "หนองคาย":
                        Stream.of("อำเภอเมืองหนองคาย", "อำเภอท่าบ่อ", "อำเภอโพนพิสัย", "อำเภอศรีเชียงใหม่",
                                "อำเภอสังคม", "อำเภอสระใคร", "อำเภอเฝ้าไร่", "อำเภอรัตนวาปี", "อำเภอโพธิ์ตาก")
                                .forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 33 */case "มหาสารคาม":
                        Stream.of("อำเภอเมืองมหาสารคาม", "อำเภอแกดำ", "อำเภอโกสุมพิสัย", "อำเภอกันทรวิชัย",
                                "อำเภอเชียงยืน", "อำเภอบรบือ", "อำเภอนาเชือก", "อำเภอพยัคฆภูมิพิสัย", "อำเภอวาปีปทุม",
                                "อำเภอนาดูน", "อำเภอยางสีสุราช", "อำเภอกุดรัง", "อำเภอชื่นชม").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 34 */case "ร้อยเอ็ด":
                        Stream.of("อำเภอเมืองร้อยเอ็ด", "อำเภอเกษตรวิสัย", "อำเภอปทุมรัตต์", "อำเภอจตุรพักตรพิมาน",
                                "อำเภอธวัชบุรี", "อำเภอพนมไพร", "อำเภอโพนทอง", "อำเภอโพธิ์ชัย", "อำเภอหนองพอก",
                                "อำเภอเสลภูมิ", "อำเภอสุวรรณภูมิ", "อำเภอเมืองสรวง", "อำเภอโพนทราย", "อำเภออาจสามารถ",
                                "อำเภอเมยวดี", "อำเภอศรีสมเด็จ", "อำเภอจังหาร", "อำเภอเชียงขวัญ", "อำเภอหนองฮี",
                                "อำเภอทุ่งเขาหลวง").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 35 */case "กาฬสินธุ์":
                        Stream.of("อำเภอเมืองกาฬสินธุ์", "อำเภอนามน", "อำเภอกมลาไสย", "อำเภอร่องคำ", "อำเภอกุฉินารายณ์",
                                "อำเภอเขาวง", "อำเภอยางตลาด", "อำเภอห้วยเม็ก", "อำเภอสหัสขันธ์", "อำเภอคำม่วง",
                                "อำเภอท่าคันโท", "อำเภอหนองกุงศรี", "อำเภอสมเด็จ", "อำเภอห้วยผึ้ง", "อำเภอสามชัย",
                                "อำเภอนาคู", "อำเภอดอนจาน", "อำเภอฆ้องชัย").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 36 */case "สกลนคร":
                        Stream.of("อำเภอเมืองสกลนคร", "อำเภอกุสุมาลย์", "อำเภอกุดบาก", "อำเภอพรรณานิคม", "อำเภอพังโคน",
                                "อำเภอวาริชภูมิ", "อำเภอนิคมน้ำอูน", "อำเภอวานรนิวาส", "อำเภอคำตากล้า", "อำเภอบ้านม่วง",
                                "อำเภออากาศอำนวย", "อำเภอสว่างแดนดิน", "อำเภอส่องดาว", "อำเภอเต่างอย",
                                "อำเภอโคกศรีสุพรรณ", "อำเภอเจริญศิลป์", "อำเภอโพนนาแก้ว", "อำเภอภูพาน")
                                .forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 37 */case "นครพนม":
                        Stream.of("อำเภอเมืองนครพนม", "อำเภอปลาปาก", "อำเภอท่าอุเทน", "อำเภอบ้านแพง", "อำเภอธาตุพนม",
                                "อำเภอเรณูนคร", "อำเภอนาแก", "อำเภอศรีสงคราม", "อำเภอนาหว้า", "อำเภอโพนสวรรค์",
                                "อำเภอนาทม", "อำเภอวังยาง").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 38 */case "มุกดาหาร":
                        Stream.of("อำเภอเมืองมุกดาหาร", "อำเภอนิคมคำสร้อย", "อำเภอดอนตาล", "อำเภอดงหลวง", "อำเภอคำชะอี",
                                "อำเภอหว้านใหญ่", "อำเภอหนองสูง").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 39 */case "เชียงใหม่":
                        Stream.of("อำเภอเมืองเชียงใหม่", "อำเภอจอมทอง", "อำเภอแม่แจ่ม", "อำเภอเชียงดาว",
                                "อำเภอดอยสะเก็ด", "อำเภอแม่แตง", "อำเภอแม่ริม", "อำเภอสะเมิง", "อำเภอฝาง",
                                "อำเภอแม่อาย", "อำเภอพร้าว", "อำเภอสันป่าตอง", "อำเภอสันกำแพง", "อำเภอสันทราย",
                                "อำเภอหางดง", "อำเภอฮอด", "อำเภอดอยเต่า", "อำเภออมก๋อย", "อำเภอสารภี", "อำเภอเวียงแหง",
                                "อำเภอไชยปราการ", "อำเภอแม่วาง", "อำเภอแม่ออน", "อำเภอดอยหล่อ", "อำเภอกัลยาณิวัฒนา")
                                .forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 40 */case "ลำพูน":
                        Stream.of("อำเภอเมืองลำพูน", "อำเภอแม่ทา", "อำเภอบ้านโฮ่ง", "อำเภอลี้", "อำเภอทุ่งหัวช้าง",
                                "อำเภอป่าซาง", "อำเภอบ้านธิ", "อำเภอเวียงหนองล่อง").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 41 */case "ลำปาง":
                        Stream.of("อำเภอเมืองลำปาง", "อำเภอแม่เมาะ", "อำเภอเกาะคา", "อำเภอเสริมงาม", "อำเภองาว",
                                "อำเภอแจ้ห่ม", "อำเภอวังเหนือ", "อำเภอเถิน", "อำเภอแม่พริก", "อำเภอแม่ทะ",
                                "อำเภอสบปราบ", "อำเภอห้างฉัตร", "อำเภอเมืองปาน").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 42 */case "อุตรดิตถ์":
                        Stream.of("อำเภอเมืองอุตรดิตถ์", "อำเภอตรอน", "อำเภอท่าปลา", "อำเภอน้ำปาด", "อำเภอฟากท่า",
                                "อำเภอบ้านโคก", "อำเภอพิชัย", "อำเภอลับแล", "อำเภอทองแสนขัน").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 43 */case "แพร่":
                        Stream.of("อำเภอเมืองแพร่", "อำเภอร้องกวาง", "อำเภอลอง", "อำเภอสูงเม่น", "อำเภอเด่นชัย",
                                "อำเภอสอง", "อำเภอวังชิ้น", "อำเภอหนองม่วงไข่").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 44 */case "น่าน":
                        Stream.of("อำเภอเมืองน่าน", "อำเภอแม่จริม", "อำเภอบ้านหลวง", "อำเภอนาน้อย", "อำเภอปัว",
                                "อำเภอท่าวังผา", "อำเภอเวียงสา", "อำเภอทุ่งช้าง", "อำเภอเชียงกลาง", "อำเภอนาหมื่น",
                                "อำเภอสันติสุข", "อำเภอบ่อเกลือ", "อำเภอสองแคว", "อำเภอภูเพียง", "อำเภอเฉลิมพระเกียรติ")
                                .forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 45 */case "พะเยา":
                        Stream.of("อำเภอเมืองพะเยา", "อำเภอภูกามยาว", "อำเภอจุน", "อำเภอเชียงคำ", "อำเภอเชียงม่วน",
                                "อำเภอดอกคำใต้", "อำเภอปง", "อำเภอแม่ใจ", "อำเภอภูซาง").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 46 */case "เชียงราย":
                        Stream.of("อำเภอเมืองเชียงราย", "อำเภอเวียงชัย", "อำเภอเชียงของ", "อำเภอเทิง", "อำเภอพาน",
                                "อำเภอป่าแดด", "อำเภอแม่จัน", "อำเภอเชียงแสน", "อำเภอแม่สาย", "อำเภอแม่สรวย",
                                "อำเภอเวียงป่าเป้า", "อำเภอพญาเม็งราย", "อำเภอเวียงแก่น", "อำเภอขุนตาล",
                                "อำเภอแม่ฟ้าหลวง", "อำเภอแม่ลาว", "อำเภอเวียงเชียงรุ้ง", "อำเภอดอยหลวง")
                                .forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 47 */case "แม่ฮ่องสอน":
                        Stream.of("อำเภอเมืองแม่ฮ่องสอน", "อำเภอขุนยวม", "อำเภอปาย", "อำเภอแม่สะเรียง",
                                "อำเภอแม่ลาน้อย", "อำเภอสบเมย", "อำเภอปางมะผ้า").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 48 */case "นครสวรรค์":
                        Stream.of("อำเภอเมืองนครสวรรค์", "อำเภอโกรกพระ", "อำเภอชุมแสง", "อำเภอหนองบัว",
                                "อำเภอบรรพตพิสัย", "อำเภอเก้าเลี้ยว", "อำเภอตาคลี", "อำเภอท่าตะโก", "อำเภอไพศาลี",
                                "อำเภอพยุหะคีรี", "อำเภอลาดยาว", "อำเภอตากฟ้า", "อำเภอแม่วงก์", "อำเภอแม่เปิน",
                                "อำเภอชุมตาบง").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 49 */case "อุทัยธานี":
                        Stream.of("อำเภอเมืองอุทัยธานี", "อำเภอทัพทัน", "อำเภอสว่างอารมณ์", "อำเภอหนองฉาง",
                                "อำเภอหนองขาหย่าง", "อำเภอบ้านไร่", "อำเภอลานสัก", "อำเภอห้วยคต").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 50 */case "กำแพงเพชร":
                        Stream.of("อำเภอเมืองกำแพงเพชร", "อำเภอไทรงาม", "อำเภอคลองลาน", "อำเภอขาณุวรลักษบุรี",
                                "อำเภอคลองขลุง", "อำเภอพรานกระต่าย", "อำเภอลานกระบือ", "อำเภอทรายทองวัฒนา",
                                "อำเภอปางศิลาทอง", "อำเภอบึงสามัคคี", "อำเภอโกสัมพีนคร").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 51 */case "ตาก":
                        Stream.of("อำเภอเมืองตาก", "อำเภอบ้านตาก", "อำเภอสามเงา", "อำเภอแม่ระมาด", "อำเภอท่าสองยาง",
                                "อำเภอแม่สอด", "อำเภอพบพระ", "อำเภออุ้มผาง", "อำเภอวังเจ้า").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 52 */case "สุโขทัย":
                        Stream.of("อำเภอเมืองสุโขทัย", "อำเภอบ้านด่านลานหอย", "อำเภอคีรีมาศ", "อำเภอกงไกรลาศ",
                                "อำเภอศรีสัชนาลัย", "อำเภอศรีสำโรง", "อำเภอสวรรคโลก", "อำเภอศรีนคร", "อำเภอทุ่งเสลี่ยม")
                                .forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 53 */case "พิษณุโลก":
                        Stream.of("อำเภอเมืองพิษณุโลก", "อำเภอนครไทย", "อำเภอชาติตระการ", "อำเภอบางระกำ",
                                "อำเภอบางกระทุ่ม", "อำเภอพรหมพิราม", "อำเภอวัดโบสถ์", "อำเภอวังทอง", "อำเภอเนินมะปราง")
                                .forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 54 */case "พิจิตร":
                        Stream.of("อำเภอเมืองพิจิตร", "อำเภอวังทรายพูน", "อำเภอโพธิ์ประทับช้าง", "อำเภอตะพานหิน",
                                "อำเภอบางมูลนาก", "อำเภอโพทะเล", "อำเภอสามง่าม", "อำเภอทับคล้อ", "อำเภอสากเหล็ก",
                                "อำเภอบึงนาราง", "อำเภอดงเจริญ", "อำเภอวชิรบารมี").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 55 */case "เพชรบูรณ์":
                        Stream.of("อำเภอเมืองเพชรบูรณ์", "อำเภอชนแดน", "อำเภอหล่มสัก", "อำเภอหล่มเก่า",
                                "อำเภอวิเชียรบุรี", "อำเภอศรีเทพ", "อำเภอหนองไผ่", "อำเภอบึงสามพัน", "อำเภอน้ำหนาว",
                                "อำเภอวังโป่ง", "อำเภอเขาค้อ").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 56 */case "ราชบุรี":
                        Stream.of("อำเภอเมืองราชบุรี", "อำเภอจอมบึง", "อำเภอสวนผึ้ง", "อำเภอดำเนินสะดวก",
                                "อำเภอบ้านโป่ง", "อำเภอบางแพ", "อำเภอโพธาราม", "อำเภอปากท่อ", "อำเภอวัดเพลง",
                                "อำเภอบ้านคา").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 57 */case "กาญจนบุรี":
                        Stream.of("อำเภอเมืองกาญจนบุรี", "อำเภอไทรโยค", "อำเภอบ่อพลอย", "อำเภอศรีสวัสดิ์",
                                "อำเภอท่ามะกา", "อำเภอท่าม่วง", "อำเภอทองผาภูมิ", "อำเภอสังขละบุรี", "อำเภอพนมทวน",
                                "อำเภอเลาขวัญ", "อำเภอด่านมะขามเตี้ย", "อำเภอหนองปรือ", "อำเภอห้วยกระเจา")
                                .forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 58 */case "สุพรรณบุรี":
                        Stream.of("อำเภอเมืองสุพรรณบุรี", "อำเภอเดิมบางนางบวช", "อำเภอด่านช้าง", "อำเภอบางปลาม้า",
                                "อำเภอศรีประจันต์", "อำเภอดอนเจดีย์", "อำเภอสองพี่น้อง", "อำเภอสามชุก", "อำเภออู่ทอง",
                                "อำเภอหนองหญ้าไซ").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 59 */case "นครปฐม":
                        Stream.of("อำเภอเมืองนครปฐม", "อำเภอกำแพงแสน", "อำเภอนครชัยศรี", "อำเภอดอนตูม", "อำเภอบางเลน",
                                "อำเภอสามพราน", "อำเภอพุทธมณฑล").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 60 */case "สมุทรสาคร":
                        Stream.of("อำเภอเมืองสมุทรสาคร", "อำเภอกระทุ่มแบน", "อำเภอบ้านแพ้ว").forEach(aumphoe -> {
                            aumphoe(aumphoe, name);
                        });
                        break;
                    /* 61 */case "สมุทรสงคราม":
                        Stream.of("อำเภอเมืองสมุทรสงคราม", "อำเภอบางคนที", "อำเภออัมพวา").forEach(aumphoe -> {
                            aumphoe(aumphoe, name);
                        });
                        break;
                    /* 62 */case "เพชรบุรี":
                        Stream.of("อำเภอเมืองเพชรบุรี", "อำเภอเขาย้อย", "อำเภอหนองหญ้าปล้อง", "อำเภอชะอำ",
                                "อำเภอท่ายาง", "อำเภอบ้านลาด", "อำเภอบ้านแหลม", "อำเภอแก่งกระจาน").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 63 */case "ประจวบคีรีขันธ์":
                        Stream.of("อำเภอเมืองประจวบคีรีขันธ์", "อำเภอกุยบุรี", "อำเภอทับสะแก", "อำเภอบางสะพาน",
                                "อำเภอบางสะพานน้อย", "อำเภอปราณบุรี", "อำเภอหัวหิน", "อำเภอสามร้อยยอด")
                                .forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 64 */case "นครศรีธรรมราช":
                        Stream.of("อำเภอเมืองนครศรีธรรมราช", "อำเภอพรหมคีรี", "อำเภอลานสกา", "อำเภอฉวาง", "อำเภอพิปูน",
                                "อำเภอเชียรใหญ่", "อำเภอชะอวด", "อำเภอท่าศาลา", "อำเภอทุ่งสง", "อำเภอนาบอน",
                                "อำเภอทุ่งใหญ่", "อำเภอปากพนัง", "อำเภอร่อนพิบูลย์", "อำเภอสิชล", "อำเภอขนอม",
                                "อำเภอหัวไทร", "อำเภอบางขัน", "อำเภอถ้ำพรรณรา", "อำเภอจุฬาภรณ์", "อำเภอพระพรหม",
                                "อำเภอนบพิตำ", "อำเภอช้างกลาง", "อำเภอเฉลิมพระเกียรติ").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 65 */case "กระบี่":
                        Stream.of("อำเภอเมืองกระบี่", "อำเภอเขาพนม", "อำเภอเกาะลันตา", "อำเภอคลองท่อม", "อำเภออ่าวลึก",
                                "อำเภอปลายพระยา", "อำเภอลำทับ", "อำเภอเหนือคลอง").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;

                    /* 66 */case "พังงา":
                        Stream.of("อำเภอเมืองพังงา", "อำเภอเกาะยาว", "อำเภอกะปง", "อำเภอตะกั่วทุ่ง", "อำเภอตะกั่วป่า",
                                "อำเภอคุระบุรี", "อำเภอทับปุด", "อำเภอท้ายเหมือง").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 67 */case "ภูเก็ต":
                        Stream.of("อำเภอเมืองภูเก็ต", "อำเภอกะทู้", "อำเภอถลาง").forEach(aumphoe -> {
                            aumphoe(aumphoe, name);
                        });
                        break;

                    /* 68 */case "สุราษฎร์ธานี":
                        Stream.of("อำเภอเมืองสุราษฎร์ธานี", "อำเภอกาญจนดิษฐ์", "อำเภอดอนสัก", "อำเภอเกาะสมุย",
                                "อำเภอเกาะพะงัน", "อำเภอไชยา", "อำเภอท่าชนะ", "อำเภอคีรีรัฐนิคม", "อำเภอบ้านตาขุน",
                                "อำเภอพนม", "อำเภอท่าฉาง", "อำเภอบ้านนาสาร", "อำเภอบ้านนาเดิม", "อำเภอเคียนซา",
                                "อำเภอเวียงสระ", "อำเภอพระแสง", "อำเภอพุนพิน", "อำเภอชัยบุรี", "อำเภอวิภาวดี")
                                .forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 69 */case "ระนอง":
                        Stream.of("อำเภอเมืองระนอง", "อำเภอละอุ่น", "อำเภอกะเปอร์", "อำเภอกระบุรี", "อำเภอสุขสำราญ")
                                .forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 70 */case "ชุมพร":
                        Stream.of("อำเภอเมืองชุมพร", "อำเภอท่าแซะ", "อำเภอปะทิว", "อำเภอหลังสวน", "อำเภอละแม",
                                "อำเภอพะโต๊ะ", "อำเภอสวี", "อำเภอทุ่งตะโก").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 71 */case "สงขลา":
                        Stream.of("อำเภอเมืองสงขลา", "อำเภอสทิงพระ", "อำเภอจะนะ", "อำเภอนาทวี", "อำเภอเทพา",
                                "อำเภอสะบ้าย้อย", "อำเภอระโนด", "อำเภอกระแสสินธุ์", "อำเภอรัตภูมิ", "อำเภอสะเดา",
                                "อำเภอหาดใหญ่", "อำเภอนาหม่อม", "อำเภอควนเนียง", "อำเภอบางกล่ำ", "อำเภอสิงหนคร",
                                "อำเภอคลองหอยโข่ง").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 72 */case "สตูล":
                        Stream.of("อำเภอเมืองสตูล", "อำเภอควนโดน", "อำเภอควนกาหลง", "อำเภอท่าแพ", "อำเภอละงู",
                                "อำเภอทุ่งหว้า", "อำเภอมะนัง").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 73 */case "ตรัง":
                        Stream.of("อำเภอเมืองตรัง", "อำเภอกันตัง", "อำเภอย่านตาขาว", "อำเภอปะเหลียน", "อำเภอสิเกา",
                                "อำเภอห้วยยอด", "อำเภอวังวิเศษ", "อำเภอนาโยง", "อำเภอรัษฎา", "อำเภอหาดสำราญ")
                                .forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 74 */case "พัทลุง":
                        Stream.of("อำเภอเมืองพัทลุง", "อำเภอกงหรา", "อำเภอเขาชัยสน", "อำเภอตะโหมด", "อำเภอควนขนุน",
                                "อำเภอปากพะยูน", "อำเภอศรีบรรพต", "อำเภอป่าบอน", "อำเภอบางแก้ว", "อำเภอป่าพะยอม",
                                "อำเภอศรีนครินทร์").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 75 */case "ปัตตานี":
                        Stream.of("อำเภอเมืองปัตตานี", "อำเภอโคกโพธิ์", "อำเภอหนองจิก", "อำเภอปะนาเระ", "อำเภอมายอ",
                                "อำเภอทุ่งยางแดง", "อำเภอสายบุรี", "อำเภอไม้แก่น", "อำเภอยะหริ่ง", "อำเภอยะรัง",
                                "อำเภอกะพ้อ", "อำเภอแม่ลาน").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 76 */case "ยะลา":
                        Stream.of("อำเภอเมืองยะลา", "อำเภอเบตง", "อำเภอบันนังสตา", "อำเภอธารโต", "อำเภอยะหา",
                                "อำเภอรามัน", "อำเภอกาบัง", "อำเภอกรงปินัง").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    /* 77 */case "นราธิวาส":
                        Stream.of("อำเภอเมืองนราธิวาส", "อำเภอตากใบ", "อำเภอบาเจาะ", "อำเภอยี่งอ", "อำเภอระแงะ",
                                "อำเภอรือเสาะ", "อำเภอศรีสาคร", "อำเภอแว้ง", "อำเภอสุคิริน", "อำเภอสุไหงโกลก",
                                "อำเภอสุไหงปาดี", "อำเภอจะแนะ", "อำเภอเจาะไอร้อง").forEach(aumphoe -> {
                                    aumphoe(aumphoe, name);
                                });
                        break;
                    default:

                        break;
                    /*
                     * 
                     * Stream.of().forEach(aumphoe -> { aumphoe(aumphoe, name); }); break;
                     * 
                     */
                    }
                });
        changwatRepository.findAll().forEach(System.out::println);

    }

    public void aumphoe(String string, String name) {
        Aumphoe a = new Aumphoe();
        Changwat findby = changwatRepository.findByChangwat(name);

        a.setAumphoe(string);
        a.setChangwatid(findby);
        aumphoeRepository.save(a);

    }

}
